# # Когда используется критерий Стьюдента, а когда Z –критерий?
# Выбор между использованием критерия Стьюдента и Z-критерия зависит от характеристик данных и
# доступной информации.
#
# Критерий Стьюдента обычно используется, когда:
#
# Размер выборки небольшой (обычно n < 30).
# Стандартное отклонение населения неизвестно.
# Данные примерно нормально распределены или размер выборки достаточно велик,
# чтобы полагаться на центральную предельную теорему.

# С другой стороны, Z-тест используется, когда:
# Размер выборки большой (обычно n ≥ 30).
# Стандартное отклонение населения известно.
# Данные примерно нормально распределены или размер выборки достаточно велик,
# чтобы полагаться на центральную предельную теорему.
# Таким образом, если размер выборки невелик и/или стандартное отклонение популяции неизвестно,
# t-критерий Стьюдента является более подходящим.
# Если размер выборки велик и известно стандартное отклонение генеральной совокупности,
# можно использовать Z-критерий.

# Стоит отметить, что на практике, когда размер выборки большой,
# результаты t-теста и Z-теста, как правило, совпадают.
# Однако, если стандартное отклонение совокупности неизвестно,
# размер выборки большой, t-критерий можно считать более надежным, поскольку
# он оценивает стандартное отклонение совокупности от выборки.